Documents/АК_ИзменениеУсловийОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>АК_ИзменениеУсловийОбслуживания</Name>
			<BasedOn>
				<xr:Item>Document.АК_ИзменениеУсловийОбслуживания</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АК_УсловияРегламентныхРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АК_ВидыОперацийИзменениеУсловийОбслуживаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеТребуетРегистрацииВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдинаяСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АК_ИзменениеУсловийОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодовОплатыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоОплатыКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧислоОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧислоОплатыКонец</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПериодовОплатыАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыПериодовОплатыАренды</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предыдущий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текущий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Следующий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансЗа2Месяца</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Финансовый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыТорговыхТочек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкороОткрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкороЗакрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АК_ИзменениеУсловийОбслуживания/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЕдинаяСтоимостьПриИзменении(Элемент)
	Элементы.Стоимость.Видимость = Объект.ЕдинаяСтоимость;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//+++АК sils 07.06.2018 ИП-00018876
	ОперацияАпдекс = APDEX_ОценкаПроизводительностиКлиентСервер.ПолучитьОперацию("Открытие документа Изменение условий обслуживания по регламентным работам");
	APDEX_ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(ОперацияАпдекс);
	//---АК
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнениеНовогоДокументаПоУмолчанию();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеНовогоДокументаПоУмолчанию()
	Объект.ДатаСоздания = ТекущаяДата();
	Объект.Дата = ТекущаяДата();
	Объект.Периодичность = ?(ЗначениеЗаполнено(Объект.Периодичность),Объект.Периодичность,Перечисления.Периодичность.Месяц);
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.ФормаОплаты = ?(ЗначениеЗаполнено(Объект.ФормаОплаты),Объект.ФормаОплаты,Перечисления.ФормыОплаты.Безналичные);
	Объект.ПериодичностьОплаты = ?(ЗначениеЗаполнено(Объект.ПериодичностьОплаты),Объект.ПериодичностьОплаты,Перечисления.ВидыПериодовОплатыАренды.Предыдущий);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РаботаСДиалогами.НачалоВыбораЗначенияДоговораКонтрагента(
		Объект, ЭтаФорма, Элемент, Объект.Контрагент, Объект.ДоговорКонтрагента, ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"), СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.Контрагент = ВыбранноеЗначение.Владелец;		
	КонецЕсли;                                 
КонецПроцедуры

&НаКлиенте
Процедура СтруктурныеТочкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	СтрокаТЧ = Элемент.ТекущиеДанные;
	Если не Копирование и НоваяСтрока Тогда
		СтрокаТЧ.ДатаНачала = Объект.ДатаНачала;
		СтрокаТЧ.ДатаОкончания = Объект.ДатаОкончания;
		СтрокаТЧ.ЧислоОплаты = Объект.ЧислоОплаты;
		СтрокаТЧ.ЧислоОплатыКонец = Объект.ЧислоОплатыКонец;
		Если Объект.ЕдинаяСтоимость Тогда
			СтрокаТЧ.Стоимость = Объект.Стоимость;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Стоимость.Видимость = Объект.ЕдинаяСтоимость;
	//+++АК sils 07.06.2018 ИП-00018876
	APDEX_ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени(ОперацияАпдекс, ?(Параметры.Ключ.Пустая(), "Новый документ", "" + Объект.Ссылка));	
	//---АК
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВсеОткрытые(Команда)
	Если Вопрос("Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьДобавитьВсеОткрытые();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавитьВсеОткрытые()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("ФормаОплаты",Объект.ФормаОплаты);
	Запрос.УстановитьПараметр("ЧислоОплаты",Объект.ЧислоОплаты);
	Запрос.УстановитьПараметр("ЧислоОплатыКонец",Объект.ЧислоОплатыКонец);
	Запрос.УстановитьПараметр("Стоимость",?(Объект.ЕдинаяСтоимость,Объект.Стоимость,0));
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтруктурныеЕдиницы.Ссылка КАК СтруктурнаяЕдиница,
	               |	&ДатаНачала,
	               |	&ДатаОкончания,
	               |	&ФормаОплаты,
	               |	&ЧислоОплаты,
	               |	&ЧислоОплатыКонец,
	               |	&Стоимость
	               |ИЗ
	               |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	               |ГДЕ
	               |	СтруктурныеЕдиницы.СтатусТорговойТочки = ЗНАЧЕНИЕ(перечисление.СтатусыТорговыхТочек.Открыт)";
	Объект.СтруктурныеЕдиницы.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Предупреждение("Сначала запишите документ.");
		Возврат;
	КонецЕсли;
	
	ФормаФайлов = Справочники.ХранилищеДополнительнойИнформации.ПолучитьФорму("ФормаСпискаФайловИИзображений", ЭтаФорма);
	
	ФормаФайлов.Изображения.Отбор.Объект.Использование                               = Истина;
	ФормаФайлов.Изображения.Отбор.Объект.Значение                                    = Объект.Ссылка;
	ФормаФайлов.ЭлементыФормы.Изображения.НастройкаОтбора.Объект.Доступность         = Ложь;
	ФормаФайлов.ЭлементыФормы.Изображения.Колонки.Объект.Видимость                   = Ложь;
	
	ФормаФайлов.ДополнительныеФайлы.Отбор.Объект.Использование                       = Истина;
	ФормаФайлов.ДополнительныеФайлы.Отбор.Объект.Значение                            = Объект.Ссылка;
	ФормаФайлов.ЭлементыФормы.ДополнительныеФайлы.НастройкаОтбора.Объект.Доступность = Ложь;
	ФормаФайлов.ЭлементыФормы.ДополнительныеФайлы.Колонки.Объект.Видимость           = Ложь;
	
	ОбязательныеОтборы = Новый Структура;
	ОбязательныеОтборы.Вставить("Объект", Объект.Ссылка);
	
	ФормаФайлов.ОбязательныеОтборы = ОбязательныеОтборы;
	
	ФормаФайлов.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеСтроки(Команда)
	ЗаполнитьСтроки(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтроки(Все)
	ТекущиеДанные = Элементы.СтруктурныеТочки.ТекущиеДанные;
	ТекущаяКолонка = Элементы.СтруктурныеТочки.ТекущийЭлемент;
	Если не ТекущиеДанные = Неопределено Тогда
		Если не ТекущаяКолонка = Элементы.СтруктурныеТочкиНомерСтроки 
			и не ТекущаяКолонка = Элементы.СтруктурныеТочкиСтруктурнаяЕдиница Тогда
			ИмяРеквизитаТЧ = СтрЗаменить(ТекущаяКолонка.Имя,"СтруктурныеТочки",""); 
			Для каждого стр из Объект.СтруктурныеЕдиницы Цикл
				Если Все или не ЗначениеЗаполнено(стр[ИмяРеквизитаТЧ]) Тогда
					стр[ИмяРеквизитаТЧ] = ТекущиеДанные[ИмяРеквизитаТЧ]; 	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПустыеСтроки(Команда)
	ЗаполнитьСтроки(Ложь);
КонецПроцедуры
